app/controllers/post_images_controller.rb

SELECT  "post_images".* FROM "post_images" ORDER BY "post_images"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "post_images"
---
  def index
    @post_images = PostImage.page(params[:page]).reverse_order

SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "post_images" WHERE "post_images"."id" = ?  [["id", 3]]
---
  def destroy
    @post_image = PostImage.find(params[:id])
    @post_image.destroy